<template>
  <section class="about-us" id="about-us">
    <div class="container">
      <div class="about-us-wrap">
        <h3 v-if="show" class="about-us-header">Про нашу компанію</h3>
        <h3 v-else class="about-us-header">О нашей компании</h3>
        <div v-if="show" class="about-us-desc">Дізнайся про нас</div>
        <div v-else class="about-us-desc">Узнай все о нас</div>
      </div>
      <div class="about-us-content-wrap">
        <div v-if="show" class="about-us-text-wrap">
          <p>Комп'ютерну службу «КомпоДоктор» організовано у 2008 році, в якій
            працюють фахівці, які мають великий досвід роботи з комп'ютерною технікою. Комп'ютерна допомога
            сьогодні – це одна з найактуальніших послуг у сфері інформаційних технологій.
            Ми постійно працюємо над покращенням якості обслуговування.
          </p>
          <p>
            Ви завжди можете розраховувати на комп'ютерну допомогу з гарантією якості та професійним
            обслуговуванням. Висококваліфіковані фахівці в короткі терміни усувають будь-які проблеми в
            роботі персональних комп'ютерів, налаштовують програмне забезпечення, навчать працювати з новими програмами,
            поділяться цінними порадами. Крім того, для Вас працює лінія технічної підтримки клієнтів, де
            Ви можете отримати безкоштовну консультацію щодо усунення несправностей, ремонту комп'ютерів,
            прикладного програмного забезпечення, а також викликати сервіс-інженера. Ми цінуємо наших клієнтів.
          </p>
          <h4>Наша місія</h4>
          <p>
            Розвивати ринок у галузі комп'ютерних послуг, досягати досконалості у всьому. Ми ніколи не
            залишаємо клієнта віч-на-віч з проблемами і завжди надаємо реальну допомогу в будь-яких ситуаціях.
            Ми повністю виправдовуємо нашу назву – «Комп'ютерний Лікар».
          </p>
          <h4>Наша філософія</h4>
          <p>
            Ми працюємо насамперед із людьми, а не з комп'ютерами. Ми дозволяємо собі отримувати прибуток тільки
            після повного вирішення проблем клієнта. Прибуток – наслідок нашої роботи.
          </p>
          <p>
            У своїй діяльності ми насамперед орієнтуємось на Ваші потреби і тому впевнено можемо
            сказати, що звернувшись до нас Ви завжди можете розраховувати на професійну комп'ютерну допомогу,
            якісне та оперативне обслуговування, ремонт комп'ютерів будь-якої складності! У якому б стані не
            був Ваш комп'ютер, звернувшись до нас, Ви можете бути впевнені, що ремонт комп'ютера зроблять справжні
            професіонали. Для Вашої зручності ремонт комп'ютерів та техніки проводиться прямо у вас вдома або
            офісі, а за потреби в нашому сервісному центрі.
          </p>
          <p>
            Комп'ютерна служба "КомпоДоктор" - це:
          </p>
          <ul class="about-us-list">
            <li>Встановлення ліцензійних програм.</li>
            <li>Ремонт комп'ютерів.</li>
            <li>Відновлення даних.</li>
            <li>Абонентське обслуговування.</li>
            <li>Монтаж та налаштування дротових та Wi-Fi мереж.</li>
            <li>Знижки на послуги.</li>
          </ul>
          <p>
            Крім якісного ремонту комп'ютерів Ви також можете отримати рекомендації щодо модернізації Ваших
            комп'ютерів, інших пристроїв та програмного забезпечення.
          </p>
        </div>

        <div v-else class="about-us-text-wrap">
          <p>Компьютерная служба «КомпоДоктор» организована в 2008 году, в которой
            работают специалисты, имеющие большой опыт работы с компьютерной техникой. Компьютерная помощь
            сегодня - это одна из наиболее актуальных услуг в сфере информационных технологий.
            Мы постоянно работаем над улучшением качества обслуживания.
          </p>
          <p>
            Вы всегда можете рассчитывать на компьютерную помощь с гарантией качества и профессиональным
            обслуживанием. Высококвалифицированные специалисты в короткие сроки устраняют любые проблемы в
            работе персональных компьютеров, настраивают программное обеспечение, обучат работать с новыми программами,
            поделятся ценными советами. Кроме того, для Вас работает линия технической поддержки клиентов, где
            Вы можете получить бесплатную консультацию по устранению возникших неполадок, ремонту компьютеров,
            прикладному программному обеспечению, а также вызвать сервис-инженера. Мы ценим наших клиентов.
          </p>
          <h4>Наша миссия</h4>
          <p>
            Развивать рынок в области компьютерных услуг, добиваться совершенства во всём. Мы никогда не
            оставляем клиента один на один с проблемами и всегда оказываем реальную помощь в любых ситуациях.
            Мы полностью оправдываем наше название - «Компьютерный Доктор».
          </p>
          <h4>Наша филосифия</h4>
          <p>
            Мы работаем, прежде всего, с людьми, а не с компьютерами. Мы позволяем себе получать прибыль только
            после полного решения проблем клиента. Прибыль - следствие нашей работы.
          </p>
          <p>
            В своей деятельности мы прежде всего ориентируемся на Ваши потребности и поэтому с уверенностью можем
            сказать, что обратившись к нам Вы всегда можете рассчитывать на профессиональную компьютерную помощь,
            качественное и оперативное обслуживание, ремонт компьютеров любой сложности! В каком бы состоянии ни
            был Ваш компьютер, обратившись к нам, Вы можете быть уверены, что ремонт компьютера произведут настоящие
            профессионалы. Для Вашего удобства ремонт компьютеров и техники производится прямо у вас дома или в
            офисе, а при необходимости в нашем сервисном центре.
          </p>
          <p>
            Компьютерная служба «КомпоДоктор» - это:
          </p>
          <ul class="about-us-list">
            <li>Установка лицензионных программ.</li>
            <li>Ремонт компьютеров.</li>
            <li>Восстановление данных.</li>
            <li>Абонентское обслуживание.</li>
            <li>Монтаж и настройка проводных и Wi-Fi сетей.</li>
            <li>Скидки на услуги.</li>
          </ul>
          <p>
            Кроме качественного ремонта компьютеров Вы также можете получить рекомендации по модернизации Ваших
            компьютеров, других устройств и программного обеспечения.
          </p>
        </div>

        <div class="about-us-img-wrap">
          <img class="img-fluid" src="@/assets/img/about-us/logo-1.png" alt="first-logo">
          <img class="img-fluid" src="@/assets/img/about-us/logo-2.png" alt="second-logo">
          <img class="img-fluid" src="@/assets/img/about-us/logo-3.png" alt="third-logo">
          <img class="img-fluid" src="@/assets/img/about-us/logo-4.png" alt="fourth-logo">
        </div>
      </div>
    </div>
  </section>

</template>

<script>
export default {
  name: "AboutUs",
  props: ['show'],
}
</script>

<style>
.about-us {
  padding-bottom: 50px;
  font-family: "Trebuchet MS", serif;
  font-size: 35px;
  font-weight: 400;
  box-shadow: 0 5px 8px -3px rgb(0 0 0 / 35%);
}

.about-us-wrap {
  display: flex;
  align-items: center;
  flex-direction: column;
}

.about-us-header {
  margin: 80px 17px 0 0;
  font-size: 35px;
  font-weight: 400;
}

.about-us-desc {
  margin-top: 15px;
  color: #b83333;
  font-size: 18px;
}

.about-us-content-wrap {
  display: flex;
  justify-content: center;
  flex-direction: row;
  color: #676767;
  font-size: 14px;
  font-weight: 400;
  line-height: 18.51px;
  align-items: center;
  margin: 50px auto 0;
  max-width: 1040px;
  text-align: justify;
}

.about-us-img-wrap {
  display: flex;
  flex-direction: column;
  text-align: center;
  margin-left: 70px;
}

.about-us-img-wrap img {
  max-height: 200px;
  max-width: 200px;
  margin-top: 10px;
}

.about-us h4 {
  margin-bottom: 5px;
  color: #272727;
  font-size: 15px;
  font-weight: 700;
}

.about-us-list {
  margin-left: 15px;
  list-style-image: url(@/assets//img/about-us/list-style.png);
}

</style>